app/Http/Controllers/Site/WebsiteController.php

select * from `blog_posts` order by `created_at` desc limit 5
---
    public function latestPosts(){
        $latestPostList = Post::orderBy('created_at','desc')->limit(5)->get();